#define _CRT_SECURE_NO_WARNINGS
#include"function.h"

void MainInterface()//主界面
{
	printf("**********************************\n");
	printf("**********************************\n");
	printf("********     0.用户     **********\n");
	printf("********     1.管理员   **********\n");
	printf("**********************************\n");
	printf("**********************************\n");
	printf("******** 请选择你的身份 **********\n");
	printf("**********************************\n");
	printf("*******!!结束运行请输入3!!********\n");
	printf("**********************************\n");
	printf("请输入号码：");
}
void AdministrationInterface()//管理员访问界面
{
	printf("***********************************\n");
	printf("******** 0.退出管理界面  **********\n");
	printf("******** 1.读取医生信息  **********\n");
	printf("******** 2.读取患者信息  **********\n");
	printf("******** 3.读取药品信息  **********\n");
	printf("******** 4.读取挂号信息  **********\n");
	printf("******** 5.读取收费信息  **********\n");
	printf("***********************************\n");
	printf("***********************************\n");
	printf("请输入操纵号码：");
}
void UserInterface()//用户界面
{
	printf("***********************************\n");
	printf("******** 0.退出用户界面  **********\n");
	printf("******** 1.进行挂号操作  **********\n");
	printf("******** 2.查看挂号信息  **********\n");
	printf("******** 3.查看收费信息  **********\n");
	printf("***********************************\n");
	printf("请输入操纵号码：");
}
